Revit 2027 API
BuiltInFailures.FabricSheetFailures.FabricSheetOutSideOfHostError Property
 Fabric Sheet is placed completely outside of its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricSheetOutSideOfHostError { get; }
Public Shared ReadOnly Property FabricSheetOutSideOfHostError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricSheetOutSideOfHostError {
	FailureDefinitionId^ get ();
}
static member FabricSheetOutSideOfHostError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricSheetFailures Class
Autodesk.Revit.DB Namespace